# GetOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..GetOptions Method
ExporterIFC Class See Also
---
Gets the collection of named options set by the exporter client.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IDictionary<string, string> GetOptions()
```

Visual Basic
---
```text
Public Function GetOptions As IDictionary(Of String, String)
```

Visual C++
---
```text
public:
IDictionary<String^, String^>^ GetOptions()
```

# ### Return Value
The collection of named options.
# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace